muhlbaier/embedded-software/hal/PIC32MX/PIC32MX350F128H/hal_eeprom.c
    // read the status bits from the specified page.
    statusByte = (eedata_addr[page-1][0] >> 17) & 0xF;
    switch(field)
    {
        case STATUS_ACTIVE:
            status = ((statusByte & 1) >> 0);
            break;
        case STATUS_CURRENT:
            status = ((statusByte & 2) >> 1);
            break;
        case STATUS_AVAILABLE:
            status = ((statusByte & 4) >> 2);
            break;
        case STATUS_EXPIRED:
            status = ((statusByte & 8) >> 3);
            break;
        default:
            status = 0;
            break;
    }

    return(status);
}

/****************************************************************************
 * Function:        ErasePage
 *
 * PreCondition:    None
 *
 * Input:           page : Page number
 *
 * Output:          None
 *
 * Side Effects:    Generates CPU stall during program/erase operations
 *                  
 * Overview:        This routine erases the selected page and update the status 
 *                  bits by incrementing the erase count.
 *
 * Note:            This is private function.
 *****************************************************************************/
unsigned int ErasePage(unsigned char page)
{
    unsigned int currentStatus;
    unsigned int retCode;

    currentStatus = ((0xFFFF0000)|eedata_addr[page-1][0])+1; //increment the erase count.

    if((currentStatus & 0xFFFF) == ERASE_WRITE_CYCLE_MAX)
    {
        retCode = NVMWriteWord((void*)eedata_addr[page-1], currentStatus&0xFFEFFFFF); //page expired
    }
    else
    {
        retCode = NVMErasePage((void*)eedata_addr[page-1]);
        if(!retCode)
            retCode = NVMWriteWord((void*)eedata_addr[page-1], currentStatus); //update the status bits
    }
    
    if(retCode & _NVMCON_LVDERR_MASK)
    {
        SetLowVoltageError(1);
        return (8);
    }
    else if(retCode & _NVMCON_WRERR_MASK)
    {
        SetPageWriteError(1);
        return (7);
    }
    return 0;
}

/****************************************************************************
 * Function:        PrevPage
 *
 * PreCondition:    None
 *
 * Input:           None
 *
 * Output:          return the previous page
 *
 * Side Effects:    None
 *
 * Overview:        This routine gives you the page before the current page
 *
 * Note:            This is a private function.
 *****************************************************************************/

unsigned int PrevPage(unsigned int currentPage)
{
   unsigned int prevPage;

   prevPage = currentPage - 1;
   if(currentPage == 1)
   prevPage = NUM_DATA_EE_PAGES;
   return prevPage;
}

/****************************************************************************
 * Function:        GetNextAvailCount
 *
 * PreCondition:    None
 *
 * Input:           None
 *
 * Output:          Page offset to next available location
 *
 * Side Effects:    None
 *
 * Overview:        This routine finds the current page and performs a backward search to find
 *                  the first available location. The available location is determined by
 *                  reading a 0xFFFF in the address region. The returned value can be added
 *                  to the first address in page to compute the available address. A return
 *                  value of 0xFFFF means the entire page was filled which is an error condition.
 *                  This routine can be called by the user to determine how full the current
 *                  page is prior to a pack.
 *
 * Note:            This is a public function.
 *****************************************************************************/
unsigned int GetNextAvailCount(void)
{
    int i = 0;
    int currentPage=0;
    int activePage = 0;
    int pageCount;
    unsigned int dataEEval;
    unsigned int nextAvailCount = 0;

    // Find the current active page.
    for (pageCount = 1; pageCount <= NUM_DATA_EE_PAGES; pageCount++)
    {
      if(GetPageStatus(pageCount, STATUS_ACTIVE) == PAGE_ACTIVE)
      {
         activePage++;
         if(GetPageStatus(pageCount, STATUS_CURRENT) == PAGE_CURRENT)
         {
            currentPage = pageCount;
         }
      }
    }

    if(currentPage == 0)
    {
       SetPageCorruptStatus(1);
    } 
    else
    {
       do
       {
          dataEEval = eedata_addr[currentPage-1][4 + i];
          if((dataEEval >> 16) == 0xFFFF)
          {
             lowerAddress = 0;
             break;
          }
          else if((dataEEval & 0xFFFF) == 0xFFFF)
          {
             lowerAddress = 1;
             break;
          }
          i++;
          nextAvailCount +=4;
       }while(nextAvailCount < DATA_OFFSET);
    }
         
    if((nextAvailCount == DATA_OFFSET)&&(activePage > 1))
    {
       nextAvailCount = 0xFFFF;  //Error - No available locations
    }
 
    return(nextAvailCount);
}

/****************************************************************************
 * Function:        EmulationCheckSum
 *
 * PreCondition:    None
 *
 * Input:           data
 *
 * Output:          return the checksum
 *
 * Side Effects:    None
 *
 * Overview:        This routine gives you the checksum for the data. Checksum will be
 *                  stored in upper 6 bits of 16 bit address value. This is mainly used
 *                  for the data integrity purpose. 
 *
 * Note:            This is a private function.
 *****************************************************************************/

unsigned char EmulationCheckSum(unsigned int data)
{
   unsigned char sum;
   
   sum = 0x3 & data;

   while((data = data >> 2))
      sum = sum + (0x3 & data);
   return sum;
}

/****************************************************************************
 * Function:        DataEEInit
 *
 * PreCondition:    None
 *
 * Input:           None
 *
 * Output:          Check the dataEEFlags for the error status.
 *                  value 0 for success.
 *                  Value 2 for expired page.
 *                  Value 6 for page corrupt status.
 *                  Value 7 for write error.
 *                  Value 8 for Low voltage operation.
 *
 * Side Effects:    Data EE flags may be updated.
 *
 * Overview:        This routine finds an unexpired page to become an active page. It then
 *                  counts the number of active pages. If no active pages are found, the
 *                  first unexpired page is initialized for emulation. If one or two active pages
 *                  found, it assumes a reset occurred and the function does nothing. If
 *                  three active pages are found, it is assumes a reset occurred during a pack.
 *                  The page after current is erased and a pack is called. This
 *                  function must be called prior to any other operation.
 *
 * Note:            This is a public function.
 *****************************************************************************/
unsigned int DataEEInit(void)
{
    unsigned int activePage=0;
    unsigned int pageCount;
    unsigned int currentPage;
    unsigned int retCode;
    int packedPage=1;         //Array row (PM page) of packed page
    int i;
    
