muhlbaier/embedded-software/hal/PIC32MX/PIC32MX350F128H/hal_eeprom.c
    if(addr >= DATA_EE_SIZE)
    {
        SetPageIllegalAddress(1);
        return(5);
    }

    // Find the current active page.
    for (pageCount = 1; pageCount <= NUM_DATA_EE_PAGES; pageCount++)
    {
      if(GetPageStatus(pageCount, STATUS_ACTIVE) == PAGE_ACTIVE)
      {
         activePage++;
         if(GetPageStatus(pageCount, STATUS_CURRENT) == PAGE_CURRENT)
         {
            currentPage = pageCount;
         }
      }
    }

    if(activePage == 0)
    {
       SetPageCorruptStatus(1);
       return(6);
    }

    addLoc = (unsigned int)eedata_addr[currentPage-1] + 16;
    
    addrIndex = 1356; // go to the end of the page where address is stored.
    do // scan the current page
    {
       addrRead = (*(int*)(addrIndex+addLoc));
       if((addrRead & 0x3FF)== addr)
       {
         dataLoc = (addrIndex*2) + DATA_OFFSET + 4 + addLoc;
         *data = (*(int*)(dataLoc));
         if(((addrRead & 0xFCFF)>>0xA) == EmulationCheckSum(*data))
         {
            return (0); //Success
         }
         else
         {
            SetPageCorruptStatus(1);
            return(6);
         }
       }
       else if(((addrRead>>16)&0x3FF) == addr)
       {
         dataLoc = (addrIndex*2) + DATA_OFFSET + addLoc;
         *data = (*(int*)(dataLoc));
         if(((addrRead & 0xFCFFFFFF)>>0x1A) == EmulationCheckSum(*data))
         {
            return 0; //Success
         }
         else
         {
            SetPageCorruptStatus(1);
            return(6);
         } 
       }
       addrIndex -=4;
    }while(addrIndex >= 0);

    if((addrIndex < 0)&&(activePage == 2))
    {
      addLoc = (unsigned int)eedata_addr[PrevPage(currentPage)-1]+16;//go to the previous page starting
    }

    if(activePage == 2)
    {
       addrIndex = 1356; // go to the end of the page where address is stored.
       do // scan the second active page.
       {
          addrRead = (*(int*)(addrIndex+addLoc));
          if((addrRead & 0x3FF)== addr)
          {
            dataLoc = (addrIndex*2) + DATA_OFFSET + 4 + addLoc;
            *data = (*(int*)(dataLoc));
            if(((addrRead & 0xFCFF)>>0xA) == EmulationCheckSum(*data))
            {
               return 0; //Success
            }
            else
            {
               SetPageCorruptStatus(1);
               return(6);
            } 
          }
          else if(((addrRead>>16)&0x3FF) == addr)
          {
            dataLoc = (addrIndex*2) + DATA_OFFSET + addLoc;
            *data = (*(int*)(dataLoc));
            if(((addrRead & 0xFCFFFFFF)>>0x1A) == EmulationCheckSum(*data))
            {
               return 0; //Success
            }
            else
            {
               SetPageCorruptStatus(1);
               return(6);
            } 
          }
          addrIndex -=4;
       }while(addrIndex >= 0);
    }
    if(addrIndex<0)
    {
        SetaddrNotFound(1);
        return(1);
    }
    return 0;
}

/****************************************************************************
 * Function:        PackEE
 *
 * PreCondition:    None
 *
 * Input:           None
 *
 * Output:          Check the dataEEFlags for the error status.
 *                  value 0 for success.
 *                  Value 6 for page corrupt status.
 *                  Value 7 for write error.
 *                  Value 8 for Low voltage operation.
 *
 * Side Effects:    Generates CPU stall during program/erase operations
 *                  Data EE flags may be updated
 *
 * Overview:        This routine finds the active page and an unexpired packed page. The most
 *                  recent data EEPROM values are located for each address will be read and 
 *                  written into pack page. Page status is read from active
 *                  page and erase/write count is incremented if page 0 is packed. After all
 *                  information is programmed and verified, the current page is erased. The
 *                  packed page becomes the current page. This function can be called at any-
 *                  time by the user to schedule the CPU stall.
 *
 * Note:            This is a public function.
 *****************************************************************************/
unsigned int PackEE(void)
{
    int currentPage;
    int pageCount;
    int activePage=0;
    int i;
    unsigned int data;
    unsigned int addr=0;
    unsigned int addCount=0;
    unsigned int addLoc;
    unsigned int nextAddLoc;
    unsigned int addrIndex=0;
    unsigned int nextDataLoc;
    unsigned int lowerAddr=0;
    unsigned int addCheckSum;
    unsigned int retCode;

    // Find the active page.
    for (pageCount = 1; pageCount <= NUM_DATA_EE_PAGES; pageCount++)
    {
      if(GetPageStatus(pageCount, STATUS_ACTIVE) == PAGE_ACTIVE)
      {
         activePage++;
         if(GetPageStatus(pageCount, STATUS_CURRENT) == PAGE_CURRENT)
         {
            currentPage = pageCount;
         }
      }
    }

    switch(activePage)
    {
      case 1:
         break;
      case 2:
         addLoc = (unsigned int)eedata_addr[currentPage %NUM_DATA_EE_PAGES]+16;

         do
         {
            addr = addCount;
            if((DataEERead(&data,addr) != 0) && (dataEEFlags.val ==1))            
            {
                addCount++;
                continue;
            }
            else if(dataEEFlags.val > 1)
            {
                SetPageCorruptStatus(1);
                return (6);
            }
            nextAddLoc = addLoc + addrIndex;
            addCheckSum = (unsigned int)EmulationCheckSum(data);
            addCheckSum = addCheckSum << 0xA;
            if(lowerAddr == 0)
            {
                addr = ((addCheckSum | addr)<<16)|0xFFFF;
                retCode = NVMWriteWord((void*)(nextAddLoc), addr);
                nextDataLoc = (addrIndex*2) + DATA_OFFSET + addLoc;
                if(!retCode)
                    retCode = NVMWriteWord((void*)(nextDataLoc), data);
                if(retCode & _NVMCON_LVDERR_MASK)
                {
                    SetLowVoltageError(1);
                    return (8);
                }
                else if(retCode & _NVMCON_WRERR_MASK)
                {
                    SetPageWriteError(1);
                    return (7);
                }
                lowerAddr = 1;
                //Check whether data and address are written correctly.
                if((addr != (*(int *)(nextAddLoc))) || (data != (*(int *)(nextDataLoc))))
                {
                    SetPageWriteError(1);
                    return(7);  //Error - RAM does not match PM
                }
            }
            else if(lowerAddr == 1)
            {
                addr = addCheckSum | addr | 0xFFFF0000;
                retCode = NVMWriteWord((void*)(nextAddLoc), addr);
                nextDataLoc = (addrIndex*2) + DATA_OFFSET + 4 + addLoc;
                if(!retCode)
                   retCode = NVMWriteWord((void*)(nextDataLoc), data);
                if(retCode & _NVMCON_LVDERR_MASK)
                {
                    SetLowVoltageError(1);
                    return (8);
                }
                else if(retCode & _NVMCON_WRERR_MASK)
                {
                    SetPageWriteError(1);
                    return (7);
                }
                addrIndex +=4;
                lowerAddr = 0;
                //Check whether data and address are written correctly.
                if(((addr<<16) != ((*(int *)(nextAddLoc))<<16)) || (data != (*(int *)(nextDataLoc))))
                {
                    SetPageWriteError(1);
                    return(7);  //Error - RAM does not match PM
                }
            }
            addCount++;
         }while(addCount < DATA_EE_SIZE);

         if(addrIndex != DATA_OFFSET)
         {
            retCode = NVMWriteWord((void*)(addLoc-16), 0xFFFDFFFF); //mark the packed page as active and current.
            ErasePage(currentPage);
            ErasePage(PrevPage(currentPage));
         }
         else
         {
            retCode = NVMWriteWord((void*)(addLoc-16), 0xFFF9FFFF); //mark the packed page as active and not current.
            ErasePage(currentPage);
            ErasePage(PrevPage(currentPage));
            
            switch(currentPage)//mark the next page as current and active.
            {
               case 1:
                  retCode = NVMWriteWord((void*)eedata_addr[2], 0xFFFDFFFF);
                  break;
               case 2:
                  retCode = NVMWriteWord((void*)eedata_addr[0], 0xFFFDFFFF);
                  break;
               case 3:
                  retCode = NVMWriteWord((void*)eedata_addr[1], 0xFFFDFFFF);
                  break;
               default:
                  break;
            }
         }
         if(retCode & _NVMCON_LVDERR_MASK)
         {
            SetLowVoltageError(1);
            return (8);
         }
         else if(retCode & _NVMCON_WRERR_MASK)
         {
            SetPageWriteError(1);
            return (7);
         }
            
         break;
      case 3:
         SetPagePackBeforeInit(1);
         break; // Error - no active page
      default:
         break;
    }

    return(0);
}

/****************************************************************************
 * Function:        DataEEWriteArray
 *
 * PreCondition:    None
 *
 * Input:           char array pointer, address to be started and the size of array
 *
 * Output:          Check the dataEEFlags for the error status.
 *                  value 0 for success.
 *                  Value 2 for expired page.
 *                  Value 4 for pack skipped.
 *                  Value 5 for Illegal address.
 *                  Value 6 for page corrupt status.
 *                  Value 7 for write error.
 *                  Value 8 for Low voltage operation.
 *
 * Side Effects:    Data EE flags may be updated. CPU stall occurs for flash
 *                  programming. Pack may be generated.
 *
 * Overview:        This routine will write a char array of data with a given 
 *                  starting address upto the array size specified by the user.
 *                  Use DataEEWriteArray function to read the data written using this function
 *                  This is solely designed to write char array.
 *
 * Note:            This is a public function.
 *****************************************************************************/
unsigned int DataEEWriteArray(unsigned char *data, unsigned int addr, unsigned int size)
{
   int i;
   int numberOfWords;
   unsigned int status=0;
   unsigned int writeData;
   unsigned char *tempData;

   if((size%4))
   {
      numberOfWords = (size/4)+1;
   }
   else
   {
      numberOfWords = (size/4);
   }
   tempData = data;
   
   for(i=0; i<numberOfWords; i++)
   {
      writeData = (((unsigned int)*tempData)<<24) | (((unsigned int)*(tempData+1))<<16) | (((unsigned int)*(tempData+2)) << 8) | (*(tempData+3));
      tempData +=4;
      if((status = DataEEWrite(writeData, addr))>0)
      {
         return status;
      }
      addr++;
   }
   return (0);
}

/****************************************************************************
 * Function:        DataEEReadArray
 *
 * PreCondition:    None
 *
 * Input:           data pointer, address to be started and the size of array
 *
 * Output:          Check the dataEEFlags for the error status.
 *                  value 0 for success.
 *                  Value 1 for address not found.
 *                  Value 5 for Illegal address.
 *                  Value 6 for page corrupt status.
 *
 * Side Effects:    Data EE flags may be updated. Reading the data in between the 
 *                  array address will cause incorrect data return.
 *
 * Overview:        This function will read a byte array of values starting from addr 
 *                  and will copy to the array pointer "data". User should read the
 *                  data from the starting address of the array. 
 *                  
 * Note:            This is a public function.
 *****************************************************************************/
unsigned int DataEEReadArray(unsigned char *data, unsigned int addr, unsigned int size)
{
   int i;
   unsigned int status=0;
   unsigned int numberOfWords;
   unsigned int readData;
   unsigned int count=0;

   if((size%4))
   {
      numberOfWords = (size/4)+1;
   }
   else
   {
      numberOfWords = (size/4);
   }
   for(i=0; i<numberOfWords; i++)
   {
      if((status = DataEERead(&readData,addr))>0)
      {
         return status;
      }
      
      *(data+count++) = (readData & 0xFF000000)>>24;
      *(data+count++) = (readData & 0xFF0000)>>16;
      *(data+count++) = (readData & 0xFF00)>>8;
      *(data+count++) = (readData & 0xFF);
      addr++;
   }
   return (0);
}
